In [1]:
%reload_ext sql
%config SqlMagic.style = '_DEPRECATED_DEFAULT'
%sql sqlite:///practice.db

# This notebook is for SQL joins

In [ ]:
# Syntax

# SELECT a.col as col_name, b.col as col_name_2
#   FROM table_a a
#   JOIN table_b b ON a.id_col = b.id_col_2;

# Types: INNER JOIN , LEFT JOIN (or LEFT OUTER JOIN ), CROSS JOIN . SQLite does not support RIGHT JOIN or FULL OUTER JOIN natively.

In [4]:
%%sql
-- Examples

-- Inner join employees with departments
SELECT e.name AS employee, d.name AS dept
FROM employees e
JOIN departments d ON e.dept_id = d.id;

-- Left join: keep all employees, even if dept_id is NULL
SELECT e.name, d.name
FROM employees e
LEFT JOIN departments d ON e.dept_id = d.id;

-- Orders with their customer names
SELECT o.id, c.name AS customer, o.total
FROM orders o
JOIN customers c ON o.customer_id = c.id;

 * sqlite:///practice.db
Done.
Done.
Done.

[(1, 'Acme Corp', 1225.0), (2, 'Cafe 123', 11.0), (3, 'Bright Co', 2400.0)]

In [ ]:
# Questions 

# 1. List order id, customer name, and order total for every order.
# 2. Show product names and the number of times they were ordered.
# 3. Show employees and their department names â€” include employees with no department.

In [5]:
%%sql
-- Answers

-- 1
SELECT o.id AS order_id, c.name AS customer_name, o.total AS order_total
FROM orders o
JOIN customers c ON o.customer_id = c.id;

 * sqlite:///practice.db
Done.

[(1, 'Acme Corp', 1225.0), (2, 'Cafe 123', 11.0), (3, 'Bright Co', 2400.0)]

In [8]:
%%sql
-- 2
SELECT p.name AS product_name, SUM(o.quantity) AS order_quantity
FROM products p
JOIN order_items o ON p.id = o.product_id
GROUP BY product_name;

 * sqlite:///practice.db
Done.

[('Laptop', 3), ('Mouse', 1), ('Mug', 1)]

In [ ]:
%%sql
-- 3
SELECT e.name AS employee_name, d.name AS department_name
FROM employees e
LEFT JOIN departments d
ON e.dept_id = d.id;

 * sqlite:///practice.db
Done.

[('Alice', 'Engineering'),
 ('Bob', 'Engineering'),
 ('Charlie', 'Sales'),
 ('Dana', 'HR'),
 ('Eve', None)]

In [ ]:
# Solutions

# SELECT o.id, c.name AS customer, o.total FROM orders o JOIN customers c ON
# o.customer_id = c.id;

#  SELECT p.name, COUNT(oi.id) AS times_ordered FROM products p JOIN
# order_items oi ON p.id = oi.product_id GROUP BY p.id;

#  SELECT e.name, d.name AS department FROM employees e LEFT JOIN departments
# d ON e.dept_id = d.id;